```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/cookiecutter-django-tfdo-demo-staging/runs/run-xo72BuQGsmc3pRDK

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_spaces_bucket.bucket: Refreshing state... [id=cookiecutter-django-tfdo-demo-staging]
data.github_repository.repo: Reading...
module.droplet.digitalocean_domain.default[0]: Refreshing state... [id=cookiecutter-django-tfdo.xyz]
module.droplet.digitalocean_droplet.droplet: Refreshing state... [id=303709101]
data.github_repository.repo: Read complete after 0s [id=cookiecutter-django-tfdo-demo]
module.droplet.digitalocean_record.default["staging.cookiecutter-django-tfdo.xyz."]: Refreshing state... [id=311918725]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.sshclient_host.host will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_host" "host" {
      + hostname                 = (known after apply)
      + id                       = (known after apply)
      + insecure_ignore_host_key = true
      + json                     = (known after apply)
      + username                 = "keyscan"
    }

  # data.sshclient_keyscan.keyscan will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_keyscan" "keyscan" {
      + authorized_key = (known after apply)
      + host_json      = (sensitive value)
      + id             = (known after apply)
    }

  # digitalocean_ssh_key.ssh_key will be created
  + resource "digitalocean_ssh_key" "ssh_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "cookiecutter-django-tfdo-demo"
      + public_key  = (known after apply)
    }

  # github_actions_environment_secret.known_hosts will be created
  + resource "github_actions_environment_secret" "known_hosts" {
      + created_at      = (known after apply)
      + environment     = "digitalocean"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cookiecutter-django-tfdo-demo"
      + secret_name     = "known_hosts"
      + updated_at      = (known after apply)
    }

  # github_actions_environment_secret.ssh will be created
  + resource "github_actions_environment_secret" "ssh" {
      + created_at      = (known after apply)
      + environment     = "digitalocean"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cookiecutter-django-tfdo-demo"
      + secret_name     = "ssh_key"
      + updated_at      = (known after apply)
    }

  # github_repository_environment.digitalocean_environment will be created
  + resource "github_repository_environment" "digitalocean_environment" {
      + environment = "digitalocean"
      + id          = (known after apply)
      + repository  = "martibosch/cookiecutter-django-tfdo-demo"
    }

  # tls_private_key.ssh will be created
  + resource "tls_private_key" "ssh" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.droplet.digitalocean_droplet.droplet is tainted, so must be replaced
-/+ resource "digitalocean_droplet" "droplet" {
      ~ created_at           = "2022-06-11T11:59:28Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "303709101" -> (known after apply)
      ~ ipv4_address         = "164.92.250.158" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "cookiecutter-django-tfdo-demo-staging"
      ~ price_hourly         = 0.02976 -> (known after apply)
      ~ price_monthly        = 20 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [
          - "34625765",
        ] -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:303709101" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "1c258bb0-6336-4320-95de-1fb9e3184054" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.droplet.digitalocean_record.default["staging.cookiecutter-django-tfdo.xyz."] will be updated in-place
  ~ resource "digitalocean_record" "default" {
        id       = "311918725"
        name     = "staging"
      ~ value    = "159.89.3.122" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ id           = "299772566" -> (known after apply)
  ~ ipv4_address = "159.89.3.122" -> (known after apply)

```